age = prompt("Будь ласка, введіть свій вік:");

if (age >= 18) {
    alert("Доступ дозволено");}
     else {alert("Доступ заборонено");}


     number = prompt("Будь ласка, введіть число:");


if (number > 0 && number % 2 === 0) {alert("Число є додатнім і парним");}
 else {alert("Число не є додатнім і парним");}

 правильний_логін = "mylogin";
 правильний_пароль = "mypassword";


 введений_логін = prompt("Будь ласка, введіть ваш логін:");
 введений_пароль = prompt("Будь ласка, введіть ваш пароль:");


if (введений_логін === правильний_логін && введений_пароль === правильний_пароль) {
    alert("Аутентифікація успішна");
} else {
    alert("Аутентифікація невдала");
}


 кількість_товарів = 7; 


 сума_покупки = 1200;


if (кількість_товарів >= 5 && сума_покупки > 1000) {
    alert("Замовлення прийнято");
} else {
    alert("Замовлення не прийнято");
}


 є_адміністратор = true; 


є_модератор = true; 


if (є_адміністратор && є_модератор) {
    alert("Користувач є адміністратором та модератором");
} else if (є_адміністратор) {
    alert("Користувач є адміністратором");
} else if (є_модератор) {
    alert("Користувач є модератором");
} else {
    alert("Користувач не належить до жодної з груп");
}



 вартість_товару = 600; 


 товар_у_наявності = true; 


if (вартість_товару > 500 && товар_у_наявності) {
    alert("Товар доступний для покупки");
} else {
    alert("Товар не доступний для покупки");
}

